Revit 2027 API
RoutingPreferenceManager.RemoveRule Method
 Removes an existing routing preference rule. Thrown if the index is out of bounds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveRule(
	RoutingPreferenceRuleGroupType groupType,
	int index
)
Public Sub RemoveRule (
	groupType As RoutingPreferenceRuleGroupType,
	index As Integer
)
public:
void RemoveRule(
	RoutingPreferenceRuleGroupType groupType,
	int index
)
member RemoveRule :
        groupType : RoutingPreferenceRuleGroupType *
        index : int -> unit
Parameters
groupType RoutingPreferenceRuleGroupType
 The routing preference group type in which the rule should be removed.
index Int32
 The index position of removed routing preference rule in the group.
Exceptions
Exception | Condition
ArgumentException |  index is not a valid zero-based index within groupType. -or-
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace